Repository: msc42/fanspeedcontrol
Catalog: src/fanspeedcontrol/locale/*.po
Languages: de

source: Are you sure to remove the lock? This is an option for experts. Wrong usage of the option remove-lock can overheat your system. See --help for more information. Type y or yes to remove the lock, n or no to not remove the lock and then enter.
de: Sind Sie sicher die Sperre zu entfernen? Dies ist eine Option für Experten. Die falsche Benutzung von der Option remove-lock kann Ihr System überhitzen. Vergleiche --help für mehr Informationen. Tippen Sie j oder ja, um die Sperre zu entfernen, n oder nein, um die Sperre nicht zu entfernen und dann enter.

source: Cannot create file logger.
de: Datei-Logger kann nicht erstellt werden.

source: Cannot create logger.
de: Logger kann nicht erstellt werden.

source: Cannot read the temperature of at least one device.
de: Die Temperatur von mindestens einem Gerät kann nicht gelesen werden.

source: Cannot set at least one device to automatic mode.
de: Mindestens ein Gerät kann nicht in den automatischen Modus gesetzt werden.

source: Cannot set fan speed of at least one device.
de: Mindestens bei einem Gerät kann die Lüftergeschwindigkeit nicht gesetzt werden.

source: Cannot set of least one device to manual mode.
de: Mindestens ein Gerät kann nicht in den manuellen Modus gesetzt werden.

source: Cannot start this fanspeedcontrol instance, because another instance has locked starting new instances. Terminate running instance to start a new instance. If you are sure, that no other instance is running, remove the lock with the option --remove-lock if you are not sure, but you want to start a new fanspeedcontrol instance, restart your system to terminate the possible running instance and remove the lock. Wrong usage of the option remove-lock can overheat your system.
de: Diese fanspeedcontrol Instanz kann nicht gestartet werden, da eine andere Instanz das Starten von neuen Instanzen gesperrt hat. Beenden Sie die laufende Instanz, um eine neue Instanz zu starten. Wenn Sie sich sicher sind, dass keine andere Instanz läuft, kann die Sperre mit der Option --remove-lock entfernt werden, wenn Sie sich nicht sicher sind, starten Sie das System neu, um mögliche laufende Instanzen zu beenden und die Sperre zu entfernen. Falsche Benutzung von der Option --remove-lock kann Ihr System überhitzen.

source: Device %s is terminated with errors.
de: Gerät %s wurde mit Fehlern beendet.

source: Device %s is terminated.
de: Gerät %s wurde beendet.

source: FILE
de: DATEI

source: Fan of %s is set to %s.
de: %d.%m.%Y %H:%M:%S

source: INTERVAL
de: INTERVALL

source: PATH
de: PFAD

source: Set at least one device to automatic mode.
de: Mindestens ein Gerät wurde in den automatischen Modus gesetzt.

source: Temperature of at least one device is very high.
de: Die Temperatur von mindestens einem Gerät ist sehr hoch.

source: The command line parameters are not valid. Please use the option --help to display valid command line parameters.
de: Die Kommandozeilenparameter sind nicht gültig. Bitte benutzen Sie die Option --help, um gültige Kommandozeilenparameter anzuzeigen.

source: The configuration file is not valid.
de: Die Konfigurationsdatei ist nicht gültig.

source: The configuration file must be in the JSON format and has the following structure for a single device configuration: required attributes: type (value: "nvidia" (support must be activated in the Nvidia driver configuration)), id (value: <id of the device as integer>), displayName (value: <display name of x server connected to the device as string>) optional attributes: hysteresis (value: <hysteresis in celsius as integer>, warn (value: <warn temperature in celsius as integer>), arbitrary number of attributes <temperature in celsius as integer> (value: <fan speed in percent as integer>) example single device JSON file:
de: Die Konfigurationsdatei muss im JSON-Format sein und hat die folgende Struktur für eine Ein-Gerät-Konfiguration: benötigte Attribute: type (Wert: "nvidia" (Unterstützung muss in der Nvidia Treiber Konfiguration aktiviert werden)), id (Wert: <ID von dem Gerät als ganze Zahl>), displayName (Wert: <Displayname des X-Servers, der mit dem Gerät verbunden ist als Zeichenkette>) optionale Attribute: hysteresis (Wert: <Hysteresis in Celsius als ganze Zahl>, warn (Wert: <Warn Temperatur in Celsius als ganze Zahl>), beliebige Anzahl von Attribute <Temperatur in Celsius als ganze Zahl> (Wert: <Lüftergeschwindigkeit in Prozent als ganze Zahl>) Beispiel Ein-Gerät-JSON-Datei:

source: The following structure is for a multi device configuration: required attributes: deviceArray (value: array with JSON objects described for the single device configuration) optional attributes: defaultHysteresis (value: <default hysteresis in celsius as integer>), defaultWarn (value: <default warn temperature in celsius as integer>) example multi device JSON file:
de: Die folgende Struktur ist für eine Mehr-Geräte-Konfiguration: benötigte Attribute: deviceArray (Wert: Liste mit JSON-Objekte beschrieben für die Ein-Gerät-Konfiguration) optionale Attribute: defaultHysteresis (Wert: <Standard Hysteresis Celsius als ganze Zahl>), defaultWarn (Wert: <Standard Warn Temperatur in Celsius als ganze Zahl>) Beispiel Mehr-Geräte-JSON-Datei:

source: Valid configuration of %s
de: Gültige Konfiguration von %s

source: display format of the configuration file
de: Format der Konfigurationsdatei anzeigen

source: display help
de: Hilfe anzeigen

source: location of the configuration file
de: Ort der Konfigurationsdatei

source: log level, possible levels: debug, info and error
de: Log Level, mögliche Levels: debug, info und error

source: minimal interval to begin over playing the sound file with the application ffplay in seconds
de: minimales Intervall, um erneut die Tondatei mit dem Programm ffplay abzuspielen

source: minimal interval to log repeatedly already occurred error messages in seconds
de: minimales Intervall, um erneut schon vorgekommene Fehlernachrichten zu loggen in Sekunden

source: minimal interval to notify repeatedly already occurred error messages in seconds
de: minimales Intervall, um erneut schon vorgekommene Fehlernachrichten anzuzeigen in Sekunden

source: option for experts, remove the lock, use the option only if the lock is set, but no other fanspeedcontrol instance is running, in doubt restart your machine rather than remove lock, wrong usage of this option can overheat your system
de: Option für Experten, entfernt die Sperre, benutzen Sie diese Option nur wenn die Sperre gesetzt, aber keine andere Instanz von fanspeedcontrol läuft, im Zweifel starten Sie ihr System neu anstatt die Sperre zu entfernen, falsche Benutzung von dieser Option kann ihr System überhitzen

source: path of an optional log file
de: Dateipfad von einer optionalen Log-Datei

source: polling interval in milliseconds
de: Abfrageintervall in Millisekunden

source: this file is played with the application ffplay in critical states
de: diese Datei wird mit dem Programm ffplay in kritischen Zuständen abgespielt

source: yes
de: ja
